{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "num_group": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "num_group": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "num_group": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 1], [28, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[21, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes0", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[52, 1, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 1], [59, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 1], [68, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[52, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes1", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 1, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution11_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[83, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes2", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split2", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[114, 1, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "122", 
        "num_group": "122", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "122", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0], [137, 0, 1], [138, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[114, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes3", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution18_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm17", 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0], [150, 0, 1], [151, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution19_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm18", 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0], [158, 0, 1], [159, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution15_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[144, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0], [167, 0, 1], [168, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution16_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm15", 
      "inputs": [[173, 0, 0], [174, 0, 0], [175, 0, 0], [176, 0, 1], [177, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution17_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm16", 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 1], [185, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[161, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes4", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split3", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution20_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution20_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[192, 1, 0], [193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm19", 
      "inputs": [[195, 0, 0], [196, 0, 0], [197, 0, 0], [198, 0, 1], [199, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution21_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution21_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm20", 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0], [207, 0, 1], [208, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution22_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[209, 0, 0], [210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm21", 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0], [215, 0, 1], [216, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[192, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape10", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes5", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split4", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution23_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[223, 1, 0], [224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm22", 
      "inputs": [[226, 0, 0], [227, 0, 0], [228, 0, 0], [229, 0, 1], [230, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[232, 0, 0], [233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm23", 
      "inputs": [[235, 0, 0], [236, 0, 0], [237, 0, 0], [238, 0, 1], [239, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution25_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[240, 0, 0], [241, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm24", 
      "inputs": [[243, 0, 0], [244, 0, 0], [245, 0, 0], [246, 0, 1], [247, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[223, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape12", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes6", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split5", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution26_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution26_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[254, 1, 0], [255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm25", 
      "inputs": [[257, 0, 0], [258, 0, 0], [259, 0, 0], [260, 0, 1], [261, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution27_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution27_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[263, 0, 0], [264, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm26_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm26_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm26_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm26_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm26", 
      "inputs": [[266, 0, 0], [267, 0, 0], [268, 0, 0], [269, 0, 1], [270, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution28_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution28_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[271, 0, 0], [272, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm27_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm27_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm27_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm27_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm27", 
      "inputs": [[274, 0, 0], [275, 0, 0], [276, 0, 0], [277, 0, 1], [278, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[254, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape14", 
      "attrs": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes7", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape15", 
      "attrs": {"shape": "(0, -3, -2)"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split6", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution29_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution29_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[285, 1, 0], [286, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm28_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm28_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm28_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm28_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm28", 
      "inputs": [[288, 0, 0], [289, 0, 0], [290, 0, 0], [291, 0, 1], [292, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[293, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution30_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution30_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "244", 
        "num_group": "244", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[294, 0, 0], [295, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm29_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm29_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm29_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm29_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm29", 
      "inputs": [[297, 0, 0], [298, 0, 0], [299, 0, 0], [300, 0, 1], [301, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution31_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution31_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "244", 
